LEXICON_COMMANDS_RU = {
    '/start': 'Запустить бота',
    '/help': 'Справка по работе бота'
}

LEXICON_ANSWERS_RU = {
    '/start': "Привет, здесь ты можешь настроить ассистента",
    '/help': "О чём этот бот",
    'other_messages': "Извини, но я не понимаю тебя :(",
    'auth_request_phone': "Давай начнём регистрацию, введи свой телефон или поделись номером",
    'auth_incorrect_phone': "Неправильный номер телефона, пришли его в формате 79998887766",
    'auth_banned_phone': "Данный номер забанен в Telegram",
    'auth_request_code': "Отлично, теперь пришли код, что тебе пришёл от Telegram, добавив к нему 1\n"
                         "К примеру тебе пришло 34502, тогда тебе надо прислать 34503",
    'auth_message_incorrect_code': "Отправь корректный код в формате 12345",
    'auth_invalid_code': "Отправьте именно тот код, что вам пришёл от Telegram, добавив к нему 1\n"
                         "К примеру тебе пришло 34502, тогда тебе надо прислать 34503",
    'auth_expired_code': "Данный код уже истёк, отправил вам новый",
    'auth_need_password': "На аккаунте включена двухфакторная аутентификация, пришлите пароль от неё",
    'auth_invalid_password': "Неправильный пароль, попробуйте ещё раз",
    'auth_successful': "Успешная авторизация"
}

LEXICON_BUTTONS_RU = {
    'register': 'Авторизоваться',
    'share_phone': 'Поделиться номером'
}